In [1]:
!type ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [2]:
import pandas as pd

In [3]:
pd.read_table('ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
!type ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [5]:
import csv

lines = list()

members= input("Please enter a member's name to be deleted.")

with open('ex1.csv', 'r') as readFile:

    reader = csv.reader(readFile)

    for row in reader:

        lines.append(row)

        for field in row:

            if field == members:

                lines.remove(row)

with open('ex1.csv', 'w') as writeFile:

    writer = csv.writer(writeFile)

    writer.writerows(lines)

Please enter a member's name to be deleted.11

In [6]:
df = pd.read_csv('ex1.csv')

In [7]:
df

   a  b  c  d message
0  1  2  3  4   hello
1  5  6  7  8   world

In [8]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [9]:
pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
names = ['a', 'b', 'c', 'd', 'message']

In [11]:
pd.read_csv('ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [12]:
!type csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,d,15,16

In [13]:
parsed = pd.read_csv('csv_mindex.csv', 
                     index_col=['key1', 'key2'])

In [14]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     d         15      16

In [15]:
list(open('ex3.txt'))

['                   A              B             C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314  -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491']

In [16]:
result = pd.read_table('ex3.txt', sep='\s+')

In [17]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [18]:
!type ex4.csv

#hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads csv files with computers anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [19]:
pd.read_csv('ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [20]:
!type ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,7,8,world
three,9,10,11,12,NULL

In [21]:
result = pd.read_csv('ex5.csv')

In [22]:
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     NaN

In [23]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False     True

In [24]:
result = pd.read_csv('ex5.csv', na_values=['NULL'])

In [25]:
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     NaN

In [26]:
sentinels = {'message': ['world'], 'something': ['two']}

In [27]:
pd.read_csv('ex5.csv', na_values=sentinels)

  something  a   b   c   d  message
0       one  1   2   3   4      NaN
1       NaN  5   6   7   8      NaN
2     three  9  10  11  12      NaN

In [28]:
data = pd.read_csv('ex5.csv')

In [29]:
data

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     NaN

In [30]:
data.to_csv('out.csv')

In [31]:
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3,4,
1,two,5,6,7,8,world
2,three,9,10,11,12,

In [32]:
import sys

In [33]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3|4|
1|two|5|6|7|8|world
2|three|9|10|11|12|

In [38]:
data2 = pd.read_csv('out.csv', index_col='Unnamed: 0')

In [39]:
data2

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     NaN

In [40]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3,4,NULL
1,two,5,6,7,8,world
2,three,9,10,11,12,NULL

In [43]:
data.to_csv(sys.stdout, index=False, header=False, na_rep='NULL')

one,1,2,3,4,NULL
two,5,6,7,8,world
three,9,10,11,12,NULL

In [44]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3
5,6,7
9,10,11

In [45]:
dates = pd.date_range('1/1/2000', periods=7)

In [47]:
import numpy as np

In [48]:
ts = pd.Series(np.arange(7), index=dates)

In [49]:
ts.to_csv('tseries.csv')

In [50]:
!type tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [51]:
!type ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [52]:
import csv
f = open('ex7.csv')

In [53]:
reader=csv.reader(f)

In [54]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [55]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))

In [56]:
header, values = lines[0], lines[1:]

In [57]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [58]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [59]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [68]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))
    reader = csv.reader(f, dialect=my_dialect)
    header, values = lines[0], lines[1:]
    data_dict = {h: v for h, v in zip(header, zip(*values))}

In [69]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [70]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

In [71]:
import json

In [78]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},{"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [79]:
result = json.loads(obj)

In [80]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [81]:
asjson = json.dumps(result)

In [82]:
result2 =json.loads(asjson)

In [83]:
result2

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [84]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [85]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [86]:
!type example.json

{"a": 1, "b": 2, "c": 3},
{"a": 4, "b": 5, "c": 6},
{"a": 7, "b": 8, "c": 9}

In [88]:
data = pd.read_json('example.json')

In [89]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [90]:
print(data.to_json)

<bound method NDFrame.to_json of    a  b  c
0  1  2  3
1  4  5  6
2  7  8  9>

In [92]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [104]:
tables = pd.read_html('FDIC_failed_bank_list.htm')

In [96]:
len(tables)

3

In [98]:
failures = tables[0]

In [99]:
failures.head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534

In [101]:
close_timestamps = pd.to_datetime(failures['Closing DateClosing'])

In [102]:
close_timestamps.dt.year.value_counts()

2020    4
2019    4
2017    4
Name: Closing DateClosing, dtype: int64

In [106]:
from lxml import objectify

In [108]:
frame = pd.read_csv('ex1.csv')

In [109]:
frame

   a  b  c  d message
0  1  2  3  4   hello
1  5  6  7  8   world

In [110]:
frame.to_pickle('ex1')

In [111]:
pd.read_pickle('ex1')

   a  b  c  d message
0  1  2  3  4   hello
1  5  6  7  8   world